TeensyBit/CraftifAI_Hackathon_RespiRater/sdkconfig.defaults
# Auto-generated defaults for the standard project layout.
CONFIG_IDF_TARGET="esp32c3"

# --- Enable NimBLE (BLE-only) ---
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# NimBLE host task can be stack-hungry depending on settings
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4000
